Revit 2027 API
Outline.GetDiagonalLength Method
 Get the length of outline's diagonal. If called on empty outline, 0. is returned
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDiagonalLength()
Public Function GetDiagonalLength As Double
public:
double GetDiagonalLength()
member GetDiagonalLength : unit -> float
Return Value
Double
 The length of the diagonal.
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace